; domain
(define (domain lunar-extended)
    (:requirements :strips :typing)

    (:types
        vehicle - object
        lander rover - vehicle

        location - object

        data - object
        image scan - data

        sample - object

        astronaut - object
    )

    (:predicates
        (flying ?l - lander); lander in flight
        (landed ?l - lander); lander stationary
        
        (carrying ?l - lander ?r - rover); lander is carrying certain rover
        (commands ?l - lander ?r - rover);lander commands a rover (they are connected)

        (undeployed ?r - rover); rover not ready
        (deployed ?r - rover); rover ready

        (path ?l1 - location ?l2 - location); path exists between 1 & 2
        (located ?x - object ?l - location) ; object is in this location
        
        (heldSample ?v - vehicle ?sa - sample); sample held in vehicle storage
        (storeEmpty ?v - vehicle); rover not holding sample

        (memEmpty ?v - vehicle); vehicle not holding data
        (heldData ?v - vehicle ?d - data); data stored in vehicle memory

        (transmitted ?d - data); img/scan has been transmitted to a lander
        (sampleDeposited ?s - sample); sample has been deposited in a lander

        (inControlRoom ?l - lander ?a - astronaut); astronaut is in lander control rool
        (inDockingBay ?l - lander ?a - astronaut); astronaut is in lander docking bay
    )

    (:action land_lander; land lander at any location
        :parameters (?l - lander ?lo - location)
        :precondition (and
            (flying ?l)
        )
        :effect (and
            (landed ?l)
            (not (flying ?l))
            (located ?l ?lo)
        )
    )

    (:action deploy_rover; deploy rover from lander that was carrying it (if astronaut in docking bay)
        :parameters (?l - lander ?a - astronaut ?r - rover ?lo - location)
        :precondition (and
            (landed ?l)
            (carrying ?l ?r)
            (commands ?l ?r)
            (located ?l ?lo)
            (undeployed ?r)

            (inDockingBay ?l ?a)
        )
        :effect (and
            (not (carrying ?l ?r))

            (not (undeployed ?r))
            (deployed ?r)
            (located ?r ?lo)
        )
    )

    (:action move_rover; move rover from one location to another
        :parameters (?r - rover ?l1 - location ?l2 - location)
        :precondition (and
            (deployed ?r)
            (located ?r ?l1)
            (path ?l1 ?l2)
        )
        :effect (and
            (not (located ?r ?l1))
            (located ?r ?l2)
        )
    )

    (:action capture_image; rover takes image at location & stores data in memory
        :parameters (?r - rover ?l - location ?i - image)
        :precondition (and
            (deployed ?r)
            (located ?r ?l)
            (located ?i ?l)
            (memEmpty ?r)
        )
        :effect (and
            (heldData ?r ?i)
            (not (memEmpty ?r))

            (not (located ?i ?l)); assumed data can only be collected once
        )
    )
    
    (:action scan_radar; rover takes scan at location & stores data in memory
        :parameters (?r - rover ?l - location ?s - scan)
        :precondition (and
            (deployed ?r)
            (located ?r ?l)
            (located ?s ?l)
            (memEmpty ?r)
        )
        :effect (and
            (heldData ?r ?s)
            (not (memEmpty ?r))

            (not (located ?s ?l)); assumed data can only be collected once
        )
    )

    (:action transmit_data; rover transmits held data to its lander (if astronaut in control room)
        :parameters (?r - rover ?l - lander ?a - astronaut ?d - data)
        :precondition (and
            (commands ?l ?r)

            (deployed ?r)
            (heldData ?r ?d)

            (inControlRoom ?l ?a)
        )
        :effect (and
            (not (heldData ?r ?d))
            (memEmpty ?r)

            (heldData ?l ?d)
            
            (transmitted ?d)
        )
    )

    (:action collect_sample; rover collects sample from location
        :parameters (?r - rover ?l - location ?sa - sample)
        :precondition (and
            (deployed ?r)
            (located ?r ?l)
            (located ?sa ?l)
            (storeEmpty ?r)
        )
        :effect (and
            (heldSample ?r ?sa)
            (not (storeEmpty ?r))

            (not (located ?sa ?l)); assumed sample can only be collected once
        )
    )

    (:action deposit_sample; put sample from rover into its lander (if astronaut in docking bay)
        :parameters (?r - rover ?l - lander ?a - astronaut ?lo - location ?sa - sample)
        :precondition (and
            (landed ?l)
            (located ?l ?lo)
            (commands ?l ?r)
            (storeEmpty ?l)

            (deployed ?r)
            (located ?r ?lo)
            (heldSample ?r ?sa)

            (inDockingBay ?l ?a)
        )
        :effect (and
            (not (heldSample ?r ?sa))
            (storeEmpty ?r)

            (heldSample ?l ?sa)
            (not (storeEmpty ?l))
            
            (sampleDeposited ?sa)
        )
    )

    (:action move_astronaut_to_controls; moves astronaut in lander to control room
        :parameters (?a - astronaut ?l - lander)
        :precondition (and
            (inDockingBay ?l ?a)
        )
        :effect (and
            (not (inDockingBay ?l ?a))
            (inControlRoom ?l ?a)
        )
    )

    (:action move_astronaut_to_docking; moves astronaut in lander to docking bay
        :parameters (?a - astronaut ?l - lander)
        :precondition (and
            (inControlRoom ?l ?a)
        )
        :effect (and
            (not (inControlRoom ?l ?a))
            (inDockingBay ?l ?a)
        )
    )
)

; problem
(define (problem lunar-mission-3)
    (:domain lunar-extended)

    (:objects
        wp1 wp2 wp3 wp4 wp5 wp6 - location

        l1 l2 - lander
        r1 r2 - rover

        alice bob - astronaut

        img1 img2 - image
        scan1 scan2 - scan

        smpl1 smpl2 - sample
    )

    (:init
        ;map
        (path wp1 wp2)
        (path wp2 wp1)
        (path wp2 wp3)
        (path wp2 wp4)
        (path wp3 wp5)
        (path wp4 wp2)
        (path wp5 wp3)
        (path wp5 wp6)
        (path wp6 wp4)

        ;landers
        (landed l1)
        (commands l1 r1)
        (storeEmpty l1)
        (located l1 wp2)
        (inDockingBay l1 alice)

        (flying l2)
        (carrying l2 r2)
        (commands l2 r2)
        (storeEmpty l2)
        (inControlRoom l2 bob)

        ;rovers
        (deployed r1)
        (storeEmpty r1)
        (memEmpty r1)
        (located r1 wp2)

        (undeployed r2)
        (storeEmpty r2)
        (memEmpty r2)

        ;points of interest
        (located img1 wp3)
        (located scan1 wp4)
        (located img2 wp2)
        (located scan2 wp6)
        (located smpl1 wp5)
        (located smpl2 wp1)
    )

    (:goal
        (and
            ;all data transmitted to landers
            (transmitted img1)
            (transmitted img2)
            (transmitted scan1)
            (transmitted scan2)
            
            ;all samples collected
            (sampleDeposited smpl1)
            (sampleDeposited smpl2)
        )
    )
)

; plan
1. (land_lander l2 wp5)
   deleted: (flying l2)
   added: (landed l2) (located l2 wp5)
   goals met: 0 of 6
2. (move_rover r1 wp2 wp1)
   deleted: (located r1 wp2)
   added: (located r1 wp1)
   goals met: 0 of 6
3. (collect_sample r1 wp1 smpl2)
   deleted: (storeempty r1) (located smpl2 wp1)
   added: (heldsample r1 smpl2)
   goals met: 0 of 6
4. (move_rover r1 wp1 wp2)
   deleted: (located r1 wp1)
   added: (located r1 wp2)
   goals met: 0 of 6
5. (capture_image r1 wp2 img2)
   deleted: (memempty r1) (located img2 wp2)
   added: (helddata r1 img2)
   goals met: 0 of 6
6. (deposit_sample r1 l1 alice wp2 smpl2)
   deleted: (heldsample r1 smpl2) (storeempty l1)
   added: (storeempty r1) (heldsample l1 smpl2) (sampledeposited smpl2)
   goals met: 1 of 6
7. (move_rover r1 wp2 wp3)
   deleted: (located r1 wp2)
   added: (located r1 wp3)
   goals met: 1 of 6
8. (move_astronaut_to_controls alice l1)
   deleted: (indockingbay l1 alice)
   added: (incontrolroom l1 alice)
   goals met: 1 of 6
9. (transmit_data r1 l1 alice img2)
   deleted: (helddata r1 img2)
   added: (memempty r1) (helddata l1 img2) (transmitted img2)
   goals met: 2 of 6
10. (capture_image r1 wp3 img1)
   deleted: (memempty r1) (located img1 wp3)
   added: (helddata r1 img1)
   goals met: 2 of 6
11. (move_rover r1 wp3 wp5)
   deleted: (located r1 wp3)
   added: (located r1 wp5)
   goals met: 2 of 6
12. (move_rover r1 wp5 wp6)
   deleted: (located r1 wp5)
   added: (located r1 wp6)
   goals met: 2 of 6
13. (transmit_data r1 l1 alice img1)
   deleted: (helddata r1 img1)
   added: (memempty r1) (helddata l1 img1) (transmitted img1)
   goals met: 3 of 6
14. (scan_radar r1 wp6 scan2)
   deleted: (memempty r1) (located scan2 wp6)
   added: (helddata r1 scan2)
   goals met: 3 of 6
15. (move_rover r1 wp6 wp4)
   deleted: (located r1 wp6)
   added: (located r1 wp4)
   goals met: 3 of 6
16. (transmit_data r1 l1 alice scan2)
   deleted: (helddata r1 scan2)
   added: (memempty r1) (helddata l1 scan2) (transmitted scan2)
   goals met: 4 of 6
17. (scan_radar r1 wp4 scan1)
   deleted: (memempty r1) (located scan1 wp4)
   added: (helddata r1 scan1)
   goals met: 4 of 6
18. (transmit_data r1 l1 alice scan1)
   deleted: (helddata r1 scan1)
   added: (memempty r1) (helddata l1 scan1) (transmitted scan1)
   goals met: 5 of 6
19. (move_astronaut_to_docking bob l2)
   deleted: (incontrolroom l2 bob)
   added: (indockingbay l2 bob)
   goals met: 5 of 6
20. (deploy_rover l2 bob r2 wp5)
   deleted: (carrying l2 r2) (undeployed r2)
   added: (deployed r2) (located r2 wp5)
   goals met: 5 of 6
21. (collect_sample r2 wp5 smpl1)
   deleted: (storeempty r2) (located smpl1 wp5)
   added: (heldsample r2 smpl1)
   goals met: 5 of 6
22. (deposit_sample r2 l2 bob wp5 smpl1)
   deleted: (heldsample r2 smpl1) (storeempty l2)
   added: (storeempty r2) (heldsample l2 smpl1) (sampledeposited smpl1)
   goals met: 6 of 6
